# Conhecendo o Python

Bem-vindo(a) ao estudo da lingugagem Python

Podemos usar fórmulas matemáticas com o Markdown:
$$ \int_a^{b}f(x)dx$$
---

In [2]:
x = 1
y = 2.57

print("X vale ", x)
print("Y vale ", y)

X vale  1
Y vale  2.57

In [3]:
x+y

3.57

In [4]:
x = "Data "
y = "Science"

print(x+y)

Data Science

In [6]:
None

## Conhecendo os Tipos

In [9]:
teste = [1,1]
type(teste)

list

In [ ]:
int(3.99)

3

## Trabalhando com o Pandas

In [14]:
import pandas as pd
import numpy as np

serie = pd.Series([3,7,5,6,"teste",8, np.nan])
serie

0        3
1        7
2        5
3        6
4    teste
5        8
6      NaN
dtype: object

In [16]:
serie.head(3)

0    3
1    7
2    5
dtype: object

In [17]:
serie.tail(2)

5      8
6    NaN
dtype: object

In [18]:
serie.shape

(7,)

In [20]:
serie.dtype

dtype('O')

In [21]:
serie.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [ ]:
#Filtragem de dados
serie[serie.isnull()]

6    NaN
dtype: object

In [23]:
serie.value_counts()

3        1
7        1
5        1
6        1
teste    1
8        1
Name: count, dtype: int64

In [27]:
data_int = pd.date_range("20250101", periods=6, freq="ME")

In [29]:
data_br = data_int.strftime("%d/%m/%Y")
data_br

Index(['31/01/2025', '28/02/2025', '31/03/2025', '30/04/2025', '31/05/2025',
       '30/06/2025'],
      dtype='object')

In [31]:
df = pd.DataFrame(
    np.random.randint(1,5, size=(6,4)),
    index=data_br,
    columns=list("ABCD"))

In [32]:
df

            A  B  C  D
31/01/2025  2  2  2  4
28/02/2025  3  2  1  3
31/03/2025  4  2  1  2
30/04/2025  3  4  1  1
31/05/2025  1  2  2  1
30/06/2025  4  4  1  1

In [33]:
df.head(3)

            A  B  C  D
31/01/2025  2  2  2  4
28/02/2025  3  2  1  3
31/03/2025  4  2  1  2

In [36]:
df.columns = ['a', 'b', 'c', 'd']

In [38]:
df.columns = ['col1','col2','col3','col4']

In [39]:
df

            col1  col2  col3  col4
31/01/2025     2     2     2     4
28/02/2025     3     2     1     3
31/03/2025     4     2     1     2
30/04/2025     3     4     1     1
31/05/2025     1     2     2     1
30/06/2025     4     4     1     1

In [47]:
df['col5'] = pd.Series([1,2,3,4,5,6], index=data_br)

In [48]:
df

            col1  col2  col3  col4  col5
31/01/2025     2     2     2     4     1
28/02/2025     3     2     1     3     2
31/03/2025     4     2     1     2     3
30/04/2025     3     4     1     1     4
31/05/2025     1     2     2     1     5
30/06/2025     4     4     1     1     6

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 31/01/2025 to 30/06/2025
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    6 non-null      int32
 1   col2    6 non-null      int32
 2   col3    6 non-null      int32
 3   col4    6 non-null      int32
 4   col5    6 non-null      int64
dtypes: int32(4), int64(1)
memory usage: 364.0+ bytes

In [50]:
df.describe()

           col1      col2      col3      col4      col5
count  6.000000  6.000000  6.000000  6.000000  6.000000
mean   2.833333  2.666667  1.333333  2.000000  3.500000
std    1.169045  1.032796  0.516398  1.264911  1.870829
min    1.000000  2.000000  1.000000  1.000000  1.000000
25%    2.250000  2.000000  1.000000  1.000000  2.250000
50%    3.000000  2.000000  1.000000  1.500000  3.500000
75%    3.750000  3.500000  1.750000  2.750000  4.750000
max    4.000000  4.000000  2.000000  4.000000  6.000000

In [52]:
df['col6'] = pd.Series(['a','b','c','d','e','f'], index=data_br)

In [53]:
df.describe()

           col1      col2      col3      col4      col5
count  6.000000  6.000000  6.000000  6.000000  6.000000
mean   2.833333  2.666667  1.333333  2.000000  3.500000
std    1.169045  1.032796  0.516398  1.264911  1.870829
min    1.000000  2.000000  1.000000  1.000000  1.000000
25%    2.250000  2.000000  1.000000  1.000000  2.250000
50%    3.000000  2.000000  1.000000  1.500000  3.500000
75%    3.750000  3.500000  1.750000  2.750000  4.750000
max    4.000000  4.000000  2.000000  4.000000  6.000000

In [54]:
df.describe(include='O')

       col6
count     6
unique    6
top       a
freq      1